import dotenv from 'dotenv';
dotenv.config();

export const BOT_TOKEN = process.env.BOT_TOKEN;
export const POSTER_TOKEN = process.env.POSTER_TOKEN;
export const COFFEE_CATEGORIES = ['1', '9', '3'];

// Список товаров, которые НЕ считаются кофейными напитками
export const EXCLUDED_PRODUCTS = [
  'Лагуна',
  'Мохито клуб',
  'Какао 0.2',
  'Какао 0.3',
  'Айс какао',
  'Шарик',
  'Какао 0.5',
  'Тоник',
  'Молочный 0,5',
  'Мохито',
  'Молочный 0,3',
  'Свежесть',
  'Тути фрути',
  'Веган матча',
  'Какао Веган 0,5',
  'Какао Веган 0,3',
  'Какао Веган 0,2',
  'Джемовые',
  'Айс матча',
  'Маття',
];

export const DOUBLE_GRINDER = [
  'Лате 0.5',
  'Капучіно 0,4',
  'Раф 0.3',
  'Флет вайт',
  'Флет бол',
  'Лонг Блэк мол',
  'Веган латте 0,5',
  'Лонг блек',
  'Раф 0.5',
  'Доппіо',
  'Флет Веган 0,2',
  'Флет Веган 0,3',
  'Mocha',
  'Лате Бостон 0.5',
  'Лате малина 0.5',
];

export const TEXT = {
  WELCOME: '☕ Статистика Doza',
  GRINDER_CHECK: 'Проверка гриндера',
  GRINDER_PAGE:
    '📊 Статистика продаж кофе\n\nВыберите дату или введите вручную в формате ДД.ММ.ГГГГ (например: 07.09.2024)',
  DATE_SELECT: '📅 Выбрать дату',
  TODAY: '🟢 Сегодня',
  YESTERDAY: '🟡 Вчера',
  INPUT_DATE: 'Введите дату в формате ДД.ММ.ГГГГ:',
};
